cases/ring_sweep/base/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       522087;
    }
    atmosphere
    {
        type            patch;
        nFaces          400;
        startFace       522487;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          6400;
        startFace       522887;
    }
)

// ************************************************************************* //
