cases/ring_sweep/base/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    ringOuter;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        p1      (0 0 0.345);
        p2      (0 0 0.355);
        radius  0.025;
    }
    {
        name    ringInner;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        p1      (0 0 0.345);
        p2      (0 0 0.355);
        radius  0.0225;
    }
    {
        name    ringOuter;
        type    cellSet;
        action  subtract;
        source  cellToCell;
        set     ringInner;
    }
    {
        name    ringZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     ringOuter;
    }
);

// ************************************************************************* //
